hysonglet/platformio_synwit/misc/svd/SWM260.svd
        <register>
          <name>XTALCR</name>
          <description>XTALCR register</description>
          <addressOffset>0x0AA020</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>_32KON</name>
              <description>_32KON field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON</name>
              <description>ON field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>_32KDET</name>
              <description>_32KDET field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DET</name>
              <description>DET field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>_32KDRV</name>
              <description>_32KDRV field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DRV</name>
              <description>DRV field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTALSR</name>
          <description>XTALSR register</description>
          <addressOffset>0x0AA024</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>_32KSTOP</name>
              <description>_32KSTOP field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>STOP field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLCR</name>
          <description>PLLCR register</description>
          <addressOffset>0x0AA040</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>OUTEN</name>
              <description>OUTEN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL</name>
              <description>INSEL field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFF</name>
              <description>OFF field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RST</name>
              <description>RST field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLDIV</name>
          <description>PLLDIV register</description>
          <addressOffset>0x0AA044</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>FBDIV</name>
              <description>FBDIV field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDIV</name>
              <description>ADDIV field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADVCO</name>
              <description>ADVCO field</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDIV</name>
              <description>INDIV field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTDIV</name>
              <description>OUTDIV field</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLLOCK</name>
          <description>PLLLOCK register</description>
          <addressOffset>0x0AA04C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>LRCCR</name>
          <description>LRCCR register</description>
          <addressOffset>0x0AA050</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ON</name>
              <description>ON field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OPACR</name>
          <description>OPACR register</description>
          <addressOffset>0x0AA070</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>OPA0ON</name>
              <description>OPA0ON field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPA1ON</name>
              <description>OPA1ON field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACMPCR</name>
          <description>ACMPCR register</description>
          <addressOffset>0x0AA080</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMP0ON</name>
              <description>CMP0ON field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP0HYS</name>
              <description>CMP0HYS field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP0IE</name>
              <description>CMP0IE field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACMPSR</name>
          <description>ACMPSR register</description>
          <addressOffset>0x0AA084</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMP0OUT</name>
              <description>CMP0OUT field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP0IF</name>
              <description>CMP0IF field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
